dic_16_to_2 = {
    '0' : '0000',
    '1' : '0001',
    '2' : '0010',
    '3' : '0011',
    '4' : '0100',
    '5' : '0101',
    '6' : '0110',
    '7' : '0111',
    '8' : '1000',
    '9' : '1001',
    'A' : '1010',
    'B' : '1011',
    'C' : '1100',
    'D' : '1101',
    'E' : '1110',
    'F' : '1111'
} # 16진법을 2진법으로 바꾸는 하드코딩

dic_2_to_16 = {
    '0000':'0' ,
     '0001':'1',
     '0010':'2',
    '0011':'3' ,
    '0100':'4' ,
    '0101':'5' ,
    '0110':'6' ,
    '0111':'7' ,
    '1000':'8',
    '1001':'9' ,
    '1010':'A' ,
    '1011':'B' ,
    '1100':'C' ,
    '1101':'D' ,
    '1110':'E' ,
    '1111':'F'
} # 2진법을 16진법으로 바꾸는 하드코딩

T = int(input())

for t in range(1,T+1):
    N,K = input().split()
    n = int(N)
    ans = '' # 답을 str 형태로 누적 저장
    if n == 24: # 2진법으로 주어진다면
        for n in range(6):
            ans += dic_2_to_16[K[n*4:n*4+4]] # 4개씩 잘라서 16진법으로

    elif n == 6: # 16진법으로 주어진다면
        for k in range(n):
            ans += dic_16_to_2[K[k]] # 2진법으로
    if ans == input():
        print('ok')
    print(f'#{t} {ans}')
